{"synonyms": ["indisposed", "way", "thankful", "vacant", "work", "near", "change", "nation", "put", "mortification", "taut", "reflect", "furnish", "petite", "nourishment", "ancient", "car", "grand", "learner", "accelerate", "hurt", "uproar", "learn", "unseal", "immense", "still", "freedom", "humiliation", "period", "accomplish", "allow", "prudent", "endeavor", "take", "homely", "bulge", "enough", "disaster", "term", "troublesome", "mature", "margin", "frolic", "reside", "answer", "play", "one", "remove", "back", "amaze", "record", "fat", "occur", "gay", "silent", "fetch", "thought", "tolerate", "consent", "diminutive", "plump", "operate", "chief", "grant", "haste", "sheet", "use", "tall", "complete", "have", "marvelous", "price", "grab", "place", "construct", "surpass", "revise", "adequate", "mistake", "anger", "cautious", "glad", "acclaim", "combine", "consume", "earnings", "discover", "total", "value", "grow", "might", "rash", "shout", "long", "tote", "detest", "glance", "ask", "depart", "locate", "blemish", "high", "daring", "many", "multitudinous", "unoccupied", "fallacy", "often", "edge", "manner", "ill", "revere", "defect", "courageous", "ugly", "repeatedly", "like", "cheat", "ornament", "able", "fury", "food", "delay", "forbid", "separate", "outlive", "power", "piece", "happy", "little", "understand", "timid", "turn", "single", "repair", "mad", "extraordinary", "winner", "reach", "principal", "great", "crook", "novice", "remark", "go away", "small", "acquiesce", "shape", "help", "delete", "make up", "sullen", "weak", "trust", "require", "alter", "crave", "commence", "morose", "provide", "beneath", "town", "clutch", "eat", "aim", "swell", "go", "interrogate", "delicate", "empty", "occupied", "flaw", "assist", "conceal", "in the vicinity", "peak", "stop", "close", "following", "flat", "waste", "raid", "sell", "helpful", "robber", "secrete", "pain", "page", "in front of", "test", "permit", "diminish", "faithful", "summit", "deceive", "take place", "elucidate", "impotent", "regretful", "pair", "exhort", "big", "experiment", "joyous", "tardy", "considerate", "frequently", "hasty", "during", "distant", "glum", "appreciative", "account", "look", "tots", "explain", "word", "initiate", "grasp", "dwell", "rage", "gift", "revolve", "under", "huge", "exceed", "applaud", "couple", "acquire", "after", "loyal", "country", "calm", "keep", "lessen", "while", "labor", "globe", "delayed", "boy", "cowardly", "pardon", "numerous", "expound", "crazy", "secluded", "fortune", "wonderful", "drawn out", "forgive", "expression", "be fond of", "just", "persist", "attain", "surprise", "need", "divide", "plain", "halt", "charm", "tense", "vehicle", "sum up", "beginner", "think", "response", "sustenance", "revive", "grateful", "terrify", "blunder", "respect", "draft", "fragile", "last", "heal", "portion", "alarm", "cure", "question", "speed", "youngsters", "recent", "write", "urge", "transport", "lad", "confirm", "vivacious", "public", "wealth", "rigid", "start", "new", "unit", "get to", "kind", "verify", "primary", "varied", "earth", "season", "noise", "faith", "form", "reply", "sufficient", "frighten", "unmoving", "abrupt", "capable", "world", "give", "excuse", "key", "listen", "busy", "independence", "subsequent", "youth", "income", "develop", "own", "despise", "live", "all", "thief", "rush", "shame", "danger", "seize", "occupation", "breakable", "name", "engaged", "purpose", "rubbish", "prohibit", "injure", "unlock", "part", "late", "leaf", "end", "hand over", "vast", "discern", "fresh", "outlast", "method", "proper", "behind", "shut", "procrastinate", "bear", "below", "children", "competent", "frequent", "murder", "protrude", "may", "restrict", "mean", "market", "designation", "thin", "persevere", "before", "saunter", "state", "enjoy", "tale", "right", "dissolve", "appreciation", "idea", "walk", "different", "reckless", "wound", "carry", "adornment", "flush", "champion", "ache", "true", "remote", "hurry", "achieve", "gratitude", "happen", "brave", "survive", "agree", "supply", "leave", "auto", "split", "attempt", "riches", "large", "donation", "decoration", "vary", "unify", "show - demonstrate", "hide", "retrieve", "feeble", "genesis", "solution", "trial", "try", "mend", "hear", "energy", "diverse", "comprehend", "sorry", "fix", "arrive", "decrease", "open", "make", "propel", "consolidate", "say", "every", "retain", "rear", "present", "story", "worth", "prior to", "finish", "stroll", "stout", "tumult", "invade", "hazard", "fascinate", "revenue", "hold", "effort", "press", "hate", "calamity", "peril", "hard", "enormous", "thaw", "swindle", "border", "lengthy", "slim", "kill", "pivot", "origin", "populace", "penitent", "close by", "enchant", "correct", "continue", "reliance", "outdo", "desire", "call", "people", "many times", "want", "begin", "clamor", "yell", "duo", "perhaps", "sudden", "fearful", "catastrophe", "see", "vacillate", "borough", "renew", "fair", "bring", "find", "birth", "restore", "build", "goal", "devour", "employ", "aged", "top", "job", "seal", "slender", "difficult", "stand for", "time", "omit", "display", "strength", "toil", "sick", "fluctuate", "add", "praise", "attack", "honor", "substantiate", "title", "careful", "annoy", "contemplate", "exertion", "aid", "old", "thanks", "level", "romp", "careless", "entire", "error", "postpone", "composed", "pester", "vend", "denote", "lofty", "waver", "tiny", "lug", "appear", "insane", "melt", "astonish", "pandemonium", "serene", "city", "concept", "attend", "victor", "junk", "liberty", "at the same time", "lively", "possess", "slaughter", "seem", "endure", "move", "bother"], "antonyms": ["shack", "immature", "thrifty", "chilly", "before", "full", "innocent", "weak", "talkative", "secluded", "restricted", "stop", "separation", "sorrow", "plump", "uneven", "upset", "transparent", "stabilize", "steal", "plentiful", "dirty", "healthy", "unstable", "begin", "go", "often", "stupid", "ordinary", "something", "sturdy", "other", "powerful", "cause", "original", "let", "pollute", "rude", "wealth", "wild", "short", "superb", "crowded", "one", "play", "brave", "lead", "sky", "pessimistic", "urge", "lost", "buy", "forbid", "all", "passive", "lie", "temporary", "countrymen", "calm", "private", "less", "crooked", "evening", "joy", "last", "reject", "sunrise", "effect", "asleep", "messy", "alone", "quick", "release", "hill", "awake", "now", "advanced", "teacher", "melt", "honor", "hurt", "no", "raise", "like", "far", "badly", "many", "inferiority", "waive", "true", "laugh", "partial", "knowledge", "adult", "following", "white", "accuracy", "sour", "polite", "aid", "capture", "retain", "old", "rise", "female", "fix", "mess", "bless", "gorgeous", "unique", "plural", "cold", "cry", "easy", "tie", "sleep", "active", "better", "vast", "there", "arrogant", "clean", "forgive", "even", "confident", "part", "apparent", "free", "improve", "fiction", "odd", "obvious", "bold", "depart", "ascend", "smooth", "general", "servant", "forward", "start", "thin", "positive", "success", "obey", "continue", "careless", "moist", "absent", "shrink", "false", "pacify", "solid", "suspect", "amuse", "father", "noise", "allow", "black", "love", "ignore", "handsome", "ancient", "shade", "limited", "away", "forgiveness", "seldom", "weakness", "his", "repel", "fail", "rear", "north", "low", "pleasant", "keep", "marvelous", "uncommon", "over", "send", "ridiculous", "sharp", "sunset", "guard", "woman", "night", "regret", "quiet", "mistake", "truth", "tight", "appear", "silence", "leading", "outside", "from", "valley", "awkward", "cruel", "hot", "horizontal", "supple", "plain", "pull", "displease", "failure", "always", "break", "moving", "intelligent", "offer", "several", "happy", "definite", "morning", "deep", "add", "spiritual", "freeze", "intent", "none", "liquid", "sick", "modesty", "finish", "remember", "together", "triumph", "flabby", "tame", "retreat", "refuse", "lively", "glossy", "show", "hell", "sparse", "good", "south", "cheerful", "drunk", "day", "generous", "beautiful", "alive", "physical", "pleasure", "wasteful", "out", "rich", "more", "rapid", "crazy", "graceful", "attack", "nasty", "adore", "glad", "loose", "body", "dark", "perceive", "idle", "backward", "expand", "bent", "disturbance", "win", "dead", "particular", "her", "life", "survive", "bright", "sterile", "serious", "noisy", "difficult", "terrible", "small", "without", "empty", "vanish", "subtract", "cautious", "sober", "stranger", "student", "head", "after", "back", "jolly", "doubt", "infect", "detest", "solution", "heal", "increase", "argue", "everybody", "professional", "sensational", "quit", "peace", "require", "earn", "change", "know", "public", "give", "high", "help", "fertile", "vague", "complete", "light", "horrible", "great", "provide", "rigid", "misplace", "dumb", "coward", "simple", "dawn", "defend", "variable", "married", "covered", "union", "strength", "pupil", "cooked", "never", "interrupt", "fat", "below", "negative", "satisfy", "integrate", "stay", "he", "cool", "slave", "hers", "raw", "top", "level", "remove", "warm", "east", "mix", "dry", "accident", "death", "thick", "gloomy", "male", "incomplete", "most", "defeat", "blunt", "left", "bare", "please", "shy", "inside", "dull", "advance", "master", "depth", "spend", "few", "unite", "apart", "thaw", "destroy", "teach", "least", "finished", "large", "palace", "elementary", "rejoice", "sit", "big", "die", "follow", "huge", "above", "prohibit", "worse", "damage", "lose", "reduce", "hidden", "then", "afraid", "", "worth", "in", "firm", "permanent", "loud", "amateur", "receive", "sensible", "insult", "greed", "discontinue", "busy", "take", "up", "problem", "alarm", "dim", "near", "on", "vacant", "height", "relax", "tragic", "repair", "deter", "pain", "close", "single", "sad", "modern", "hard", "exceptional", "earth", "forget", "copy", "hurry", "same", "admire", "permit", "obscure", "obese", "minor", "miscellaneous", "bring", "well", "trusting", "foot", "stale", "curse", "common", "make", "alert", "segregate", "stingy", "offend", "expensive", "down", "pride", "constant", "here", "vertical", "poverty", "center", "cheap", "long", "girl", "sophisticated", "open", "evil", "maintain", "bad", "some", "hero", "unlikely", "west", "bitter", "rare", "tidiness", "kind", "fire", "ignorance", "ready", "humble", "accomplishment", "nice", "gain", "sink", "preceding", "complex", "adjacent", "get", "trust", "profit", "heaven", "distant", "cowardly", "uselessness", "encourage", "she", "guilty", "still", "arrive", "admit", "boy", "yes", "hire", "asked", "bore", "thorough", "criticism", "unknown", "fresh", "sell", "sound", "shame", "ugly", "friend", "timid", "stand", "brief", "slow", "present", "visitor", "soul", "foreigner", "wake", "praise", "new", "funny", "bottom", "under", "wreck", "soak", "fancy", "grief", "little", "optimistic", "descend", "weep", "leave", "toward", "find", "poor", "tall", "deny", "young", "hide", "to", "divide", "panic", "loss", "affirm", "push", "specific", "random", "smart", "mature", "transform", "slender", "different", "unprepared", "gentle", "separate", "man", "found", "work", "pass", "question", "front", "tidy", "remain", "child", "sadness", "lonely", "speechless", "ultimate", "whole", "edge", "hate", "sweet", "end", "villain", "move", "answer", "mother", "inactive", "achieve", "polish", "naive", "dislike", "soothe", "pretty", "shallow", "with", "nobody", "comic", "off", "ground", "major", "lower", "heavy", "quality", "guess", "right", "soft", "harsh", "gladness", "place", "first", "tiny", "compliment", "enemy", "told", "annoy", "agitate", "attract", "famous", "stiff", "fast", "him", "purify", "nothing", "birth", "straight", "rough", "agree", "individual", "inferior", "sane", "primary", "flexible", "wrong", "fact", "prevent", "hinder", "create", "comfort", "command", "loosen", "tighten", "come", "likely", "wet", "started", "worship", "group", "blame", "revenge", "learn"], "hyponyms": ["bird", "dog", "cat", "gun", "movie", "book", "car", "liquid", "computer", "instrument", "device", "muscle", "tree", "house", "event", "fruit", "vegetable", "animal", "appliance", "weapon", "clothing", "furniture", "plant", "dessert", "fish", "body of water", "government", "music", "climate", "boat", "meat", "shape", "organ", "mammal", "nut", "metal", "emotion", "insect", "science", "monkey", "dance", "sport", "room", "weather", "shoe", "atom", "fabric", "disease", "natural disaster", "truck", "game", "relative", "herb", "job", "blade", "liquor", "tool", "math", "ball", "coin", "pasta", "color", "recyclable", "profession", "transportation", "mental illness", "craft", "soup", "rock", "gemstone", "hat", "building", "store", "language", "grain", "jewelry", "wood", "machine", "landscape", "doctor", "", "", ""], "meronyms": ["airplane", "airport", "alligator", "apple", "aquarium", "army", "atmosphere", "ballpark", "bathroom", "battle", "beach", "bed", "bicycle", "bird", "boat", "book", "brain", "building", "bus", "business", "cabinet", "camera", "car", "casino", "cat", "cave", "chicken", "city", "classroom", "coat", "computer", "cookie", "court", "desert", "desk", "dictionary", "document", "dog", "door", "dungeon", "eagle", "elephant", "email", "event", "eye", "face", "factory", "farm", "feather", "female", "film", "finger", "fish", "flag", "flower", "fort", "game", "glasses", "greenhouse", "guitar", "gym", "hamburger", "harbor", "helicopter", "honeybee", "horse", "hotel", "house", "hunter", "iphone", "island", "jailhouse", "keyboard", "king", "kitchen", "knife", "knight", "laboratory", "lake", "laptop", "lawn", "lecture", "library", "liquid", "lizard", "lounge", "magazine", "male", "mammal", "mansion", "map", "market", "meal", "microwave", "monkey", "moon", "mouth", "museum", "nation", "neighborhood", "needle", "newspaper", "nightclub", "notebook", "novel", "ocean", "office", "opera", "orchestra", "oven", "painting", "pants", "park", "party", "pan", "pencil", "picture", "pie", "pipe", "pizza", "planet", "plant", "poem", "pond", "pool", "population", "president", "product", "pumpkin", "purse", "quarter", "radio", "raspberry", "recipe", "refrigerator", "region", "restaurant", "rifle", "robot", "rocket", "school", "sentence", "shack", "shark", "ship", "shoe", "skateboard", "solar system", "soldier", "song", "sphere", "stadium", "stew", "stopsign", "storm", "story", "table", "tank", "textbook", "ticket", "town", "train", "tree", "triangle", "truck", "turtle", "university", "video", "violin", "volcano", "wedding", "wheel", "yard", "zebra", "zoo"]}