able
capable
competent
abrupt
sudden
hasty
achieve
accomplish
attain
add
total
sum up
after
following
subsequent
aim
purpose
goal
all
every
entire
allow
permit
grant
anger
rage
fury
answer
response
reply
arrive
reach
get to
ask
question
interrogate
astonish
surprise
amaze
back
rear
behind
bear
endure
tolerate
before
prior to
in front of
begin
start
initiate
below
under
beneath
birth
origin
genesis
border
edge
margin
bother
annoy
pester
boy
lad
youth
brave
courageous
daring
bulge
swell
protrude
busy
occupied
engaged
call
shout
yell
calm
composed
serene
car
auto
vehicle
carry
tote
lug
careful
cautious
prudent
change
vary
alter
change
vary
alter
charm
fascinate
enchant
cheat
deceive
swindle
children
youngsters
tots
city
borough
town
close
shut
seal
consent
agree
acquiesce
continue
persevere
persist
country
nation
state
cure
heal
restore
danger
peril
hazard
decrease
lessen
diminish
defect
flaw
blemish
delay
postpone
procrastinate
different
varied
diverse
disaster
calamity
catastrophe
divide
separate
split
during
while
at the same time
dwell
live
reside
eat
consume
devour
effort
exertion
endeavor
end
finish
complete
energy
power
strength
enough
adequate
sufficient
error
mistake
fallacy
explain
expound
elucidate
faith
trust
reliance
fat
plump
stout
fetch
bring
retrieve
find
locate
discover
fix
repair
mend
flat
level
flush
food
nourishment
sustenance
form
shape
make up
fragile
delicate
breakable
freedom
independence
liberty
frequent
often
many times
gay
lively
vivacious
gift
present
donation
give
grant
hand over
glum
morose
sullen
go
leave
depart
grateful
appreciative
thankful
great
grand
large
grow
mature
develop
happy
glad
joyous
have
own
possess
hard
difficult
troublesome
hate
detest
despise
heal
mend
cure
help
aid
assist
hide
conceal
secrete
high
tall
lofty
hold
grasp
clutch
hurry
rush
accelerate
idea
thought
concept
ill
sick
indisposed
income
revenue
earnings
injure
wound
hurt
job
work
occupation
junk
rubbish
waste
just
fair
right
keep
hold
retain
key
answer
solution
kind
considerate
helpful
kill
slaughter
murder
large
big
enormous
last
endure
persist
late
tardy
delayed
learn
acquire
understand
leave
depart
go away
like
enjoy
be fond of
listen
hear
attend
little
small
petite
long
lengthy
drawn out
look
glance
see
mad
crazy
insane
make
build
construct
many
multitudinous
numerous
marvelous
wonderful
extraordinary
mean
stand for
denote
mend
repair
restore
method
way
manner
might
may
perhaps
mistake
error
blunder
move
transport
propel
name
title
designation
near
close by
in the vicinity
need
require
want
new
fresh
recent
noise
uproar
clamor
novice
beginner
learner
occur
happen
take place
often
frequently
repeatedly
omit
delete
remove
one
single
unit
old
aged
ancient
open
unlock
unseal
ornament
decoration
adornment
outlive
survive
outlast
page
sheet
leaf
pain
ache
hurt
pair
couple
duo
pardon
forgive
excuse
part
portion
piece
peak
summit
top
people
public
populace
play
frolic
romp
praise
acclaim
applaud
primary
chief
principal
prohibit
forbid
restrict
put
place
locate
raid
attack
invade
reckless
careless
rash
remote
distant
secluded
renew
restore
revive
respect
honor
revere
revise
alter
correct
right
correct
proper
say
state
remark
seem
appear
look
sell
vend
market
shame
humiliation
mortification
sorry
regretful
penitent
speed
haste
hurry
start
begin
commence
stop
halt
end
story
tale
account
show - demonstrate
display
still
unmoving
silent
strength
power
energy
supply
provide
furnish
surpass
exceed
outdo
take
grab
seize
tense
taut
rigid
terrify
frighten
alarm
thanks
gratitude
appreciation
thaw
melt
dissolve
thief
robber
crook
thin
slender
slim
think
reflect
contemplate
time
period
season
timid
fearful
cowardly
tiny
small
diminutive
trial
test
experiment
try
attempt
endeavor
turn
revolve
pivot
true
faithful
loyal
ugly
homely
plain
understand
comprehend
discern
unify
consolidate
combine
uproar
tumult
pandemonium
urge
press
exhort
use
operate
employ
vacant
empty
unoccupied
value
worth
price
vast
huge
immense
verify
confirm
substantiate
victor
winner
champion
walk
stroll
saunter
want
desire
crave
waver
fluctuate
vacillate
weak
feeble
impotent
wealth
riches
fortune
word
term
expression
work
labor
toil
world
globe
earth
write
record
draft
