above
below
absent
present
accident
intent
accomplishment
failure
achieve
fail
add
subtract
adjacent
distant
admire
detest
admit
reject
adore
hate
advance
retreat
affirm
deny
afraid
confident
after
before
aid
hinder
alarm
comfort
alert
asleep
alive
dead
allow
forbid
alone
together
amateur
professional
amuse
bore
ancient
modern
annoy
soothe
answer
question
apparent
obscure
argue
agree
arrive
depart
arrogant
humble
ascend
descend
attack
defend
attract
repel
awake
asleep
awkward
graceful
back
front
bad
good
bare
covered
beautiful
ugly
before
after
bent
straight
better
worse
big
little
birth
death
bitter
sweet
black
white
blunt
sharp
body
soul
bold
timid
bottom
top
brave
cowardly
break
repair
brief
long
bright
dull
bring
remove
boy
girl
busy
idle
buy
sell
capture
release
cause
effect
cautious
careless
center
edge
change
remain
cheap
expensive
child
adult
chilly
warm
clean
dirty
close
open
cold
hot
command
obey
complex
simple
compliment
insult
constant
variable
continue
interrupt
cool
warm
copy
original
countrymen
foreigner
crazy
sane
crooked
straight
cruel
kind
cry
laugh
curse
bless
damage
improve
dark
light
dawn
sunset
day
night
deep
shallow
destroy
create
difficult
easy
dim
bright
divide
unite
doubt
trust
drunk
sober
dull
sharp
dumb
smart
earth
sky
east
west
easy
hard
elementary
advanced
end
begin
even
odd
evening
morning
evil
good
exceptional
common
expand
shrink
fail
pass
failure
success
false
true
famous
unknown
fancy
plain
fast
slow
fat
thin
fiction
fact
find
lose
finish
start
firm
flabby
fix
break
follow
lead
forgive
blame
forward
backward
free
restricted
fresh
stale
friend
enemy
funny
sad
full
empty
gain
lose
generous
stingy
gentle
harsh
get
give
give
receive
glad
sad
gloomy
cheerful
glossy
dull
go
come
gorgeous
ugly
great
small
greed
generous
grief
joy
ground
sky
guard
attack
guess
know
handsome
ugly
happy
sad
hard
soft
hate
love
he
she
head
foot
heal
infect
healthy
sick
heaven
hell
heavy
light
height
depth
help
hinder
hero
coward
high
low
hill
valley
him
her
hire
fire
his
hers
hot
cold
horrible
pleasant
huge
tiny
hurry
slow
hurt
help
idle
active
in
out
individual
group
innocent
guilty
inside
outside
intelligent
stupid
jolly
serious
joy
sadness
keep
lose
kind
cruel
knowledge
ignorance
large
small
last
first
laugh
cry
leading
following
leave
arrive
left
right
less
more
let
prevent
level
uneven
lie
truth
life
death
like
dislike
likely
unlikely
liquid
solid
little
big
lively
inactive
lonely
crowded
long
short
loose
tight
lost
found
loud
soft
love
hate
maintain
discontinue
major
minor
make
destroy
male
female
man
woman
many
few
marvelous
terrible
mature
immature
melt
freeze
mess
tidiness
miscellaneous
specific
mistake
accuracy
mix
separate
moist
dry
more
less
most
least
mother
father
move
stay
naive
sophisticated
nasty
nice
near
far
never
always
new
old
no
yes
nobody
everybody
noise
quiet
none
all
north
south
nothing
something
now
then
obese
thin
obvious
hidden
odd
even
offend
please
offer
refuse
often
seldom
old
young
on
off
one
several
ordinary
uncommon
other
same
over
under
pacify
agitate
pain
pleasure
panic
calm
part
whole
partial
complete
particular
general
pass
fail
passive
active
peace
disturbance
perceive
ignore
permanent
unstable
permit
refuse
pessimistic
optimistic
physical
spiritual
place
misplace
plain
fancy
play
work
plentiful
sparse
plump
thin
polish
dull
polite
rude
pollute
purify
poor
rich
positive
negative
powerful
weak
praise
criticism
preceding
following
present
absent
pretty
ugly
prevent
encourage
pride
modesty
private
public
problem
solution
profit
loss
prohibit
allow
pupil
teacher
push
pull
quality
inferiority
quick
slow
quiet
noisy
quit
start
raise
lower
random
specific
rapid
slow
rare
common
raw
cooked
ready
unprepared
rear
front
reduce
increase
regret
rejoice
relax
tighten
remember
forget
repair
destroy
retain
lose
revenge
forgiveness
ridiculous
sensible
right
wrong
rigid
flexible
rise
sink
rough
smooth
rude
polite
sad
happy
same
different
satisfy
displease
secluded
public
segregate
integrate
seldom
often
sell
buy
send
receive
sensational
dull
servant
master
shack
palace
shade
light
shame
honor
sharp
dull
she
he
short
long
show
hide
shy
trusting
sick
healthy
silence
sound
single
married
single
plural
sit
stand
slave
master
slender
fat
slow
fast
small
large
soak
dry
sober
drunk
some
none
something
nothing
sorrow
gladness
sour
sweet
speechless
talkative
spend
earn
stale
fresh
start
stop
started
finished
stay
leave
steal
provide
sterile
fertile
stiff
flexible
still
moving
stingy
generous
stop
go
stranger
friend
strength
weakness
student
teacher
sturdy
weak
sunrise
sunset
superb
inferior
supple
rigid
survive
die
suspect
trust
take
give
tall
short
tame
wild
teach
learn
temporary
permanent
thaw
freeze
there
here
thin
thick
thorough
incomplete
thrifty
wasteful
tidy
messy
tie
loosen
timid
bold
to
from
together
apart
told
asked
top
bottom
toward
away
tragic
comic
transform
retain
transparent
triumph
defeat
true
false
truth
lie
ultimate
primary
union
separation
unique
common
up
down
upset
stabilize
urge
deter
vacant
full
vague
definite
vanish
appear
vast
limited
vertical
horizontal
villain
hero
visitor
waive
require
wake
sleep
wealth
poverty
weep
laugh
well
badly
wet
dry
white
black
wild
tame
win
lose
with
without
worship
detest
worth
uselessness
wreck

